# ğŸˆ pandas í”¼ë´‡íŒ…ê³¼ ê·¸ë£¹ë³„ ë¶„ì„

- í”¼ë´‡íŒ…
- ìŠ¤íƒœí‚¹ê³¼ ì–¸ìŠ¤íƒœí‚¹
- ê·¸ë£¹ë³„ ì§‘ê³„, ë³€í˜•, í•„í„°

In [2]:
import pandas as pd
import numpy as np

In [3]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

# 1. í”¼ë´‡íŒ…(pivoting)

- ê°€ì§€ê³  ìˆëŠ” ë°ì´í„°ì›ë³¸ì„ ì›í•˜ëŠ” í˜•íƒœì˜ ê°€ê³µëœ ì •ë³´ë¥¼ ë³´ì—¬ì£¼ëŠ” ê²ƒ
    - ìë£Œì˜ í˜•íƒœë¥¼ ë³€ê²½í•˜ê¸° ìœ„í•´ ë§ì´ ì‚¬ìš©í•˜ëŠ” ë°©ë²•

### í”¼ë³´íŒ…ì„ ìœ„í•œ ë©”ì†Œë“œ : pivot(), pivot_table()

![](./img/pivoting.png)

- ì¶œì²˜ : https://rfriend.tistory.com/275

### pivot( )
- pandas.pivot(data, index=None, columns=None, values=None)
- DataFrame.pivot(index=None, columns=None, values=None)

### pivot_table( )

- ë°©ë²• : **ë‘ ê°œì˜ í‚¤ë¥¼ ì‚¬ìš©**í•´ì„œ ë°ì´í„°ë¥¼ ì„ íƒ



- **pivot_table(data, index=None, columns=None, values=None**,
    aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True)
    
    - data : ë¶„ì„í•  ë°ì´í„° í”„ë ˆì„ì˜ ë©”ì„œë“œ í˜•ì‹ì¼ ë•ŒëŠ” í•„ìš”í•˜ì§€ ì•ŠìŒ 
        - ex1. pandas.pivot_table(df1, )
        - ex2. df1.pivot_table()
    - index :  **í–‰ ì¸ë±ìŠ¤**ë¡œ ë“¤ì–´ê°ˆ í‚¤ì—´ ë˜ëŠ” í‚¤ì—´ì˜ ë¦¬ìŠ¤íŠ¸
    - columns : **ì—´ ì¸ë±ìŠ¤**ë¡œ ë“¤ì–´ê°ˆ í‚¤ì—´ ë˜ëŠ” í‚¤ì—´ì˜ ë¦¬ìŠ¤íŠ¸
    - values : ë¶„ì„í•  ë°ì´í„° í”„ë ˆì„ì—ì„œ ë¶„ì„í•  ì—´
    - fill_value : NaNì´ í‘œì¶œë  ë•Œ ëŒ€ì²´ê°’ ì§€ì •
    - margins : ëª¨ë“  ë°ì´í„°ë¥¼ ë¶„ì„í•œ ê²°ê³¼ë¥¼ í–‰ìœ¼ë¡œ í‘œì¶œí•  ì§€ ì—¬ë¶€
    - margins_name : marginsê°€ í‘œì¶œë  ë•Œ ê·¸ ì—´(í–‰)ì˜ ì´ë¦„`

#### í”¼ë´‡í…Œì´ë¸”ì„ ì‘ì„±í•  ë•Œ ë°˜ë“œì‹œ ì„¤ì •í•´ì•¼ ë˜ëŠ” ì¸ìˆ˜
- data : ì‚¬ìš© ë°ì´í„° í”„ë ˆì„
- index : í–‰ ì¸ë±ìŠ¤ë¡œ ì‚¬ìš©í•  í•„ë“œ(ê¸°ì¤€ í•„ë“œë¡œ ì‘ìš©ë¨)
- values : ì¸ë±ìŠ¤ ëª…ì„ ì œì™¸í•œ ë‚˜ë¨¸ì§€ ê°’(data)ì€ ìˆ˜ì¹˜ data ë§Œ ì‚¬ìš©í•¨
- aggfunc: ê¸°ë³¸ í•¨ìˆ˜ê°€ í‰ê· (mean)í•¨ìˆ˜ ì´ê¸° ë•Œë¬¸ì— ê° ë°ì´í„°ì˜ í‰ê· ê°’ì´ ë°˜í™˜

### ì˜ˆì œ1. pivot() ì‚¬ìš©

In [4]:
data = {
    "ë„ì‹œ": ["ì„œìš¸", "ì„œìš¸", "ì„œìš¸", "ë¶€ì‚°", 
           "ë¶€ì‚°", "ë¶€ì‚°", "ì¸ì²œ", "ì¸ì²œ"],
    "ì—°ë„": ["2015", "2010", "2005", "2015",
           "2010", "2005", "2015", "2010"],
    "ì¸êµ¬": [9904312, 9631482, 9762546, 3448737,
           3393191, 3512547, 2890451, 263203],
    "ì§€ì—­": ["ìˆ˜ë„ê¶Œ", "ìˆ˜ë„ê¶Œ", "ìˆ˜ë„ê¶Œ", "ê²½ìƒê¶Œ",
           "ê²½ìƒê¶Œ", "ê²½ìƒê¶Œ", "ìˆ˜ë„ê¶Œ", "ìˆ˜ë„ê¶Œ"]
}

columns = ["ë„ì‹œ", "ì—°ë„", "ì¸êµ¬", "ì§€ì—­"]

df1 = pd.DataFrame(data, columns=columns)
df1

   ë„ì‹œ    ì—°ë„       ì¸êµ¬   ì§€ì—­
0  ì„œìš¸  2015  9904312  ìˆ˜ë„ê¶Œ
1  ì„œìš¸  2010  9631482  ìˆ˜ë„ê¶Œ
2  ì„œìš¸  2005  9762546  ìˆ˜ë„ê¶Œ
3  ë¶€ì‚°  2015  3448737  ê²½ìƒê¶Œ
4  ë¶€ì‚°  2010  3393191  ê²½ìƒê¶Œ
5  ë¶€ì‚°  2005  3512547  ê²½ìƒê¶Œ
6  ì¸ì²œ  2015  2890451  ìˆ˜ë„ê¶Œ
7  ì¸ì²œ  2010   263203  ìˆ˜ë„ê¶Œ

**í”¼ë²—ë°ì´ë¸”1 : ê° ë„ì‹œì— ëŒ€í•œ ì—°ë„ë³„ í‰ê·  ì¸êµ¬**

In [5]:
# ê° ë„ì‹œì— ëŒ€í•œ ì—°ë„ë³„ í‰ê·  ì¸êµ¬

df1.pivot('ë„ì‹œ','ì—°ë„','ì¸êµ¬')   # ê¸°ë³¸ê°’ìœ¼ë¡œ aggfunc='mean' ìœ¼ë¡œ ì„¤ì •ë˜ì–´ìˆìŒ

ì—°ë„       2005       2010       2015
ë„ì‹œ
ë¶€ì‚°  3512547.0  3393191.0  3448737.0
ì„œìš¸  9762546.0  9631482.0  9904312.0
ì¸ì²œ        NaN   263203.0  2890451.0

**í”¼ë²—í…Œì´ë¸”2: ì§€ì—­ë³„ ë„ì‹œì— ëŒ€í•œ ì—°ë„ë³„ í‰ê·  ì¸êµ¬**

In [6]:
# ê° ì§€ì—­ë³„ ë„ì‹œì— ëŒ€í•œ ì—°ë„ë³„ í‰ê·  ì¸êµ¬
df1.pivot(['ì§€ì—­','ë„ì‹œ'],'ì—°ë„','ì¸êµ¬')

ì—°ë„           2005       2010       2015
ì§€ì—­  ë„ì‹œ
ê²½ìƒê¶Œ ë¶€ì‚°  3512547.0  3393191.0  3448737.0
ìˆ˜ë„ê¶Œ ì„œìš¸  9762546.0  9631482.0  9904312.0
    ì¸ì²œ        NaN   263203.0  2890451.0

### ì˜ˆì œ2. íƒ€ì´íƒ€ë‹‰ ë°ì´í„° : pivot_table() ì‚¬ìš©

In [8]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')[['age','sex','class','fare','survived']]
df.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

**í”¼ë´‡í…Œì´ë¸”1 : ì„ ì‹¤ë“±ê¸‰ë³„ ìˆ™ë°•ê°ì˜ ì„±ë³„ í‰ê·  ë‚˜ì´**

In [11]:
# ê° ì„ ì‹¤ ë“±ê¸‰ë³„ë¡œ ìˆ™ë°•ê°ì˜ ì„±ë³„ í‰ê·  ë‚˜ì´
pd.pivot_table(df, index='class', columns='sex', values='age')

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

**í”¼ë´‡í…Œì´ë¸”2 : ì„ ì‹¤ë“±ê¸‰ë³„ ìˆ™ë°•ê°ì˜ ìƒì¡´ì—¬ë¶€ì— ë”°ë¥¸ í‰ê·  ë‚˜ì´**

In [12]:
# ê° ì„ ì‹¤ ë“±ê¸‰ë³„ ìˆ™ë°•ê°ì˜ ìƒì¡´ì ìˆ˜ì™€ ìƒì¡´ìœ¨
pd.pivot_table(df, index='class', columns='survived', 
               values='age')

survived          0          1
class
First     43.695312  35.368197
Second    33.544444  25.901566
Third     26.555556  20.646118

**í”¼ë´‡í…Œì´ë¸”3 : ì„ ì‹¤ë“±ê¸‰ê³¼ ì„±ë³„ì— ëŒ€í•´ ìƒì¡´ì—¬ë¶€ì— ë”°ë¥¸ ë‚˜ì´ì™€ í‹°ì¼“ê°’ì˜ í‰ê· ê³¼ ìµœëŒ€ê°’ ê³„ì‚°**

In [14]:
pd.pivot_table(df, index=['class', 'sex'], columns='survived', 
               values=['age','fare'],aggfunc=['mean','max'])

                    mean                                      max        \
                     age                   fare               age
survived               0          1           0           1     0     1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0
       male    27.255814  22.274211   12.204469   15.579696  74.0  45.0


                 fare
survived            0         1
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875
       male     69.55   56.4958

# 2. ìŠ¤íƒœí‚¹(stacking)ê³¼ ì–¸ìŠ¤íƒœê¹…(unstacking)

: í”¼ë²—íŒ…ê³¼ ìœ ì‚¬í•˜ì§€ë§Œ ê³„ì¸µí˜• ì¸ë±ìŠ¤ì˜ íŠ¹ì • ìˆ˜ì¤€ë„ íšŒì „ì´ ê°€ëŠ¥í•¨

- ìŠ¤íƒœí‚¹(stacking) : ì»¬ëŸ¼ ë ˆì´ë¸”ê³¼ ê·¸ ê°’ì„ ë¡œìš° ì¸ë±ìŠ¤ì™€ ê°’ìœ¼ë¡œ íšŒì „ì‹œí‚´
- ì–¸ìŠ¤íƒœí‚¹(unstacking) : ë¡œìš° ì¸ë±ìŠ¤ì™€ ê·¸ ê°’ì´ ì»¬ëŸ¼ ë ˆì´ë¸”ê³¼ ê°’ìœ¼ë¡œ íšŒì „ì‹œí‚´

- DataFrame.unstack(level=- 1, fill_value=None)
    - level : int, str, list, default=-1
        - ì–¸ìŠ¤íƒœí‚¹ì„ ì ìš©í•˜ëŠ” ë ˆë²¨
        - ê¸°ë³¸ê°’ì€ ë§ˆì§€ë§‰ ë ˆë²¨ : ì–¸ìŠ¤íƒœí‚¹ ê²°ê³¼ í•­ìƒ ë§ˆì§€ë§‰ ë ˆë²¨ë¡œ ì´ë™
    - fill_value : int, str or dict
        - ì–¸ìŠ¤íƒœí‚¹ ê²°ê³¼ ê²°ì¸¡ì¹˜ëŠ” NaNìœ¼ë¡œ ëŒ€ì²´
        
        
- DataFrame.stack(level=- 1, dropna=True)
    - level : int, str, list, default=-1
        - ì–¸ìŠ¤íƒœí‚¹ì„ ì ìš©í•˜ëŠ” ë ˆë²¨
        - ê¸°ë³¸ê°’ì€ ë§ˆì§€ë§‰ ë ˆë²¨ : ì–¸ìŠ¤íƒœí‚¹ ê²°ê³¼ í•­ìƒ ë§ˆì§€ë§‰ ë ˆë²¨ë¡œ ì´ë™
    - dropna : bool, default True
        - ìŠ¤íƒœí‚¹ ê²°ê³¼ ê²°ì¸¡ì¹˜ ì²˜ë¦¬ ì—¬ë¶€, ê¸°ë³¸ê°’ì€ Trueë¡œ ê²°ì¸¡ì¹˜ ì œì™¸

![](./img/stacking.png)

### ìŠ¤íƒœí‚¹(stacking)

**ì˜ˆì œ. single level columnsë¥¼ ê°–ëŠ” ë°ì´í„°**

In [17]:
# single level coloumns
multicol = pd.MultiIndex.from_tuples([('weight','kg'),('weight','pounds')])
df = pd.DataFrame([[0, 1], [2, 3]],
                  index=['cat', 'dog'],
                  columns=['weight', 'height'])
df

     weight  height
cat       0       1
dog       2       3

**ìŠ¤íƒœí‚¹(stacking)**

In [16]:
df.stack()

cat  weight    0
     height    1
dog  weight    2
     height    3
dtype: int64

**ì˜ˆì œ. multi-level columnsì„ ê°–ëŠ” ë°ì´í„°1**

In [19]:
df2 = pd.DataFrame([[0, 1], [2, 3]],
                  index=['cat', 'dog'],
                  columns=multicol)
df2

    weight
        kg pounds
cat      0      1
dog      2      3

**ìŠ¤íƒœí‚¹(stacking)**

In [20]:
# ë§ˆì§€ë§‰ ë ˆë²¨ë¡œ ì´ë™
df2.stack()

            weight
cat kg           0
    pounds       1
dog kg           2
    pounds       3

**ì˜ˆì œ. multi-level columnsì„ ê°–ëŠ” ë°ì´í„°2**

In [21]:
multicol2 = pd.MultiIndex.from_tuples([('weight','kg'),('height','m')])
df3 = pd.DataFrame([[0, 1], [2, 3]],
                  index=['cat', 'dog'],
                  columns=multicol2)
df3

    weight height
        kg      m
cat      0      1
dog      2      3

**ìŠ¤íƒœí‚¹(stacking)**

In [22]:
# ìŠ¤íƒœí‚¹ ê²°ê³¼ ë§ˆì§€ë§‰ ë ˆë²¨ë¡œ ì´ë™
df3.stack()

        height  weight
cat kg     NaN     0.0
    m      1.0     NaN
dog kg     NaN     2.0
    m      3.0     NaN

In [23]:
# ìŠ¤íƒœí‚¹ ê²°ê³¼ ì²«ë²ˆì§¸ ë ˆë²¨ë¡œ ì´ë™
df3.stack(0)

             kg    m
cat height  NaN  1.0
    weight  0.0  NaN
dog height  NaN  3.0
    weight  2.0  NaN

In [24]:
# ë‘ ë‹¨ê³„ ë ˆë²¨ ëª¨ë‘ ì´ë™
df3.stack([0,1])

cat  height  m     1.0
     weight  kg    0.0
dog  height  m     3.0
     weight  kg    2.0
dtype: float64

**ì˜ˆì œ. multi-level columnsì„ ê°–ëŠ” ë°ì´í„°3**

In [25]:
multicol2 = pd.MultiIndex.from_tuples([('weight','kg'),('height','m')])
df4 = pd.DataFrame([[None, 1.0], [2.0, 3.0]],
                  index=['cat', 'dog'],
                  columns=multicol2)
df4

    weight height
        kg      m
cat    NaN    1.0
dog    2.0    3.0

**ìŠ¤íƒœí‚¹(stacking) ê²°ê³¼ ê²°ì¸¡ì¹˜ ì²˜ë¦¬ : dropna ì¸ìˆ˜**

In [26]:
# ìŠ¤íƒœí‚¹ ê²°ê³¼ ê²°ì¸¡ì¹˜ í–‰ í¬í•¨
df4.stack(dropna=False)

        height  weight
cat kg     NaN     NaN
    m      1.0     NaN
dog kg     NaN     2.0
    m      3.0     NaN

In [27]:
# ìŠ¤íƒœí‚¹ ê²°ê³¼ ê²°ì¸¡ì¹˜ í–‰ ì‚­ì œ
df4.stack(dropna=True)

        height  weight
cat m      1.0     NaN
dog kg     NaN     2.0
    m      3.0     NaN

: rowì˜ ê° ì—´ì— ëª¨ë‘ ê²°ì¸¡ì¹˜ê°€ ìˆëŠ” ê²½ìš° ìŠ¤íƒœí‚¹ ê²°ê³¼ ì‚­ì œë¨

### ì–¸ìŠ¤íƒœí‚¹(unstacking)

**ì˜ˆì œ ë°ì´í„°**

In [28]:
index = pd.MultiIndex.from_tuples([('one', 'a'), ('one', 'b'),
                                   ('two', 'a'), ('two', 'b')])
s = pd.Series(np.arange(1.0, 5.0), index=index)
s

one  a    1.0
     b    2.0
two  a    3.0
     b    4.0
dtype: float64

**ë§ˆì§€ë§‰ ë ˆë²¨ë¡œ ì–¸ìŠ¤íƒœí‚¹(unstacking)**

In [32]:
s.unstack()

       a    b
one  1.0  2.0
two  3.0  4.0

**ì²«ë²ˆì§¸ ë ˆë²¨ë¡œ ì–¸ìŠ¤íƒœí‚¹(unstacking)**

In [31]:
s.unstack(level=0)

   one  two
a  1.0  3.0
b  2.0  4.0

# 3. ê·¸ë£¹ ë¶„ì„

- ê·¸ë£¹ë¶„ì„(group analysis)ì€ í”¼ë´‡í…Œì´ë¸”ê³¼ ë‹¬ë¦¬ í‚¤ì— ì˜í•´ì„œ ê²°ì •ë˜ëŠ” ë°ì´í„°ê°€ ì—¬ëŸ¬ ê°œ ìˆëŠ” ê²½ìš° ë¯¸ë¦¬ ì§€ì •í•œ ì—°ì‚°ì„ í†µí•´ ê° ê·¸ë£¹ ë°ì´í„°ì˜ ëŒ€í‘œê°’ì„ ê³„ì‚°í•˜ëŠ” ê²ƒ


- ë§Œì•½ í‚¤ê°€ ì§€ì •í•˜ëŠ” ì¡°ê±´ì— ë§ëŠ” ë°ì´í„°ê°€ í•˜ë‚˜ ì´ìƒì´ë¼ì„œ ë°ì´í„° ê·¸ë£¹ì„ ì´ë£¨ëŠ” ê²½ìš°ì—ëŠ” ê·¸ë£¹ì˜ íŠ¹ì„±ì„ ë³´ì—¬ì£¼ëŠ” ê·¸ë£¹ë¶„ì„ì„ í•´ì•¼ í•¨

### ë°ì´í„° ë¶„ì„ì„ ìœ„í•œ ë¶„í• -ì ìš©-ì¡°í•© íŒ¨í„´

- ë¶„í• (SPLIT) : ì–´ë–¤ ê¸°ì¤€ì— ë”°ë¼ ë°ì´í„°ì…‹ì„ ì‘ì€ ì¡°ê°ìœ¼ë¡œ ë¶„í• í•œë‹¤
- ì ìš©(APPLY) : ê° ì¡°ê°ì— ëŒ€í•´ ë…ë¦½ì ìœ¼ë¡œ ì—°ì‚°ì„ ìˆ˜í–‰í•œë‹¤
- ì¡°í•©(COMBINE) : ëª¨ë“  ê²°ê³¼ë¥¼ ë‹¤ì‹œ í•˜ë‚˜ì˜ ë‹¨ìœ„ë¡œ ì¡°í•©í•œë‹¤

![](./img/groupby.png)

### ë°ì´í„° ë¶„í• (split) ì‘ì—…
- ì‹œë¦¬ì¦ˆë‚˜ ë°ì´í„°í”„ë ˆì„ì˜ **groupby() ë©”ì†Œë“œ**ë¡œ ìˆ˜í–‰
- í•˜ë‚˜ ì´ìƒì˜ ì¸ë±ìŠ¤ ë ˆì´ë¸”ì´ë‚˜ ì»¬ëŸ¼ëª…ì„ ì§€ì •í•˜ì—¬ ì´ì— ê¸°ì´ˆí•˜ì—¬ ì—°ê´€ëœ ê°’ë“¤ì´ ê·¸ë£¹í™” ë¨


- íŒë‹¤ìŠ¤ì—ì„œëŠ” **groupby() ë©”ì„œë“œ**ë¥¼ ì‚¬ìš©í•˜ì—¬ ë‹¤ìŒê³¼ ê°™ì´ ê·¸ë£¹ë¶„ì„ì„ ì§„í–‰
    - ë¶„ì„í•˜ê³ ì í•˜ëŠ” ì‹œë¦¬ì¦ˆë‚˜ ë°ì´í„°í”„ë ˆì„ì— **groupby() ë©”ì„œë“œ**ë¥¼ í˜¸ì¶œí•˜ì—¬ ê·¸ë£¹í™” ìˆ˜í–‰
    - ê·¸ë£¹ ê°ì²´ì— ëŒ€í•´ ê·¸ë£¹ì—°ì‚°ì„ ìˆ˜í–‰

##### groupby () ë©”ì„œë“œÂ¶

- ë°ì´í„°ë¥¼ ê·¸ë£¹ ë³„ë¡œ ë¶„ë¥˜í•˜ëŠ” ì—­í• ì„ í•¨ 

- groupby() ë©”ì„œë“œì˜ ì¸ìˆ˜

    - ì—´ ë˜ëŠ” ì—´ì˜ ë¦¬ìŠ¤íŠ¸

    - í–‰ ì¸ë±ìŠ¤

- ì—°ì‚° ê²°ê³¼ : ê·¸ë£¹ ë°ì´í„°ë¥¼ ë‚˜íƒ€ë‚´ëŠ”**GroupBy í´ë˜ìŠ¤ ê°ì²´ë¥¼ ë°˜í™˜**
    - ì´ ê°ì²´ì—ëŠ” ê·¸ë£¹ë³„ë¡œ ì—°ì‚°ì„ í•  ìˆ˜ ìˆëŠ” ê·¸ë£¹ì—°ì‚° ë©”ì„œë“œê°€ ìˆìŒ

### ë°ì´í„° ë¶„í•  í›„ ê° ê·¸ë£¹ì— ì ìš©ë˜ëŠ” ì‘ì—…

- ì§‘ê³„(aggregation) : ê° ê·¸ë£¹ì˜ ì•„ì´í…œì— ëŒ€í•œ í‰ê· ì´ë‚˜ ê°œìˆ˜ ê³„ì‚°
- ë³€í˜•(transform) : ê·¸ë£¹ì´ë‚˜ ì•„ì´í…œì— íŠ¹ì •ì ì¸ ê³„ì‚°ì„ ìˆ˜í–‰
- í•„í„°ë§(filtering) : ê·¸ë£¹ ë‹¨ìœ„ì˜ ê³„ì‚°ì— ê¸°ì´ˆí•´ ë¶ˆí•„ìš”í•œ ë°ì´í„° ê·¸ë£¹ ì œê±°

#### GroupBy í´ë˜ìŠ¤ ê°ì²´ì˜ ê·¸ë£¹ì—°ì‚° ë©”ì†Œë“œ

- size, count: ê·¸ë£¹ ë°ì´í„°ì˜ ê°¯ìˆ˜

- mean, median, min, max: ê·¸ë£¹ ë°ì´í„°ì˜ í‰ê· , ì¤‘ì•™ê°’, ìµœì†Œ, ìµœëŒ€

- sum, prod, std, var, quantile : ê·¸ë£¹ ë°ì´í„°ì˜ í•©ê³„, ê³±, í‘œì¤€í¸ì°¨, ë¶„ì‚°, ì‚¬ë¶„ìœ„ìˆ˜

- first, last: ê·¸ë£¹ ë°ì´í„° ì¤‘ ê°€ì¥ ì²«ë²ˆì§¸ ë°ì´í„°ì™€ ê°€ì¥ ë‚˜ì¤‘ ë°ì´í„°


#### ê·¸ì™¸ ìì£¼ ì´ìš©ë˜ëŠ” ê·¸ë£¹ë³„ ì—°ì‚°ê´€ë ¨ ë©”ì†Œë“œ

- agg, aggregate

    - ë§Œì•½ ì›í•˜ëŠ” ê·¸ë£¹ì—°ì‚°ì´ ì—†ëŠ” ê²½ìš° í•¨ìˆ˜ë¥¼ ë§Œë“¤ê³  ì´ í•¨ìˆ˜ë¥¼ aggì— ì „ë‹¬í•œë‹¤.

    - ë˜ëŠ” ì—¬ëŸ¬ê°€ì§€ ê·¸ë£¹ì—°ì‚°ì„ ë™ì‹œì— í•˜ê³  ì‹¶ì€ ê²½ìš° í•¨ìˆ˜ ì´ë¦„ ë¬¸ìì—´ì˜ ë¦¬ìŠ¤íŠ¸ë¥¼ ì „ë‹¬í•œë‹¤.

- describe

    - í•˜ë‚˜ì˜ ê·¸ë£¹ ëŒ€í‘œê°’ì´ ì•„ë‹ˆë¼ ì—¬ëŸ¬ê°œì˜ ê°’ì„ ë°ì´í„°í”„ë ˆì„ìœ¼ë¡œ êµ¬í•œë‹¤.

- apply

    - describe ì²˜ëŸ¼ í•˜ë‚˜ì˜ ëŒ€í‘œê°’ì´ ì•„ë‹Œ ë°ì´í„°í”„ë ˆì„ì„ ì¶œë ¥í•˜ì§€ë§Œ ì›í•˜ëŠ” ê·¸ë£¹ì—°ì‚°ì´ ì—†ëŠ” ê²½ìš°ì— ì‚¬ìš©í•œë‹¤.

- transform

    - ê·¸ë£¹ì— ëŒ€í•œ ëŒ€í‘œê°’ì„ ë§Œë“œëŠ” ê²ƒì´ ì•„ë‹ˆë¼ ê·¸ë£¹ë³„ ê³„ì‚°ì„ í†µí•´ ë°ì´í„° ìì²´ë¥¼ ë³€í˜•í•œë‹¤.

![](./img/groupby2.png)

## ë°ì´í„° ë¶„í• 

1. ë‹¨ì¼ ì»¬ëŸ¼ì˜ ê·¸ë£¹í™”
2. ë³µìˆ˜ ì»¬ëŸ¼ì˜ ê·¸ë£¹í™”
3. ì¸ë±ìŠ¤ ë ˆë²¨ì„ ì´ìš©í•œ ê·¸ë£¹í™”

### ì˜ˆì œ ë°ì´í„° ì¤€ë¹„

In [36]:
df5 = pd.DataFrame({'key1' : ['A', 'A', 'B', 'B', 'A'],
                    'key2' : ['one', 'two', 'one', 'two', 'one'],
                    'data1' : [i for i in range(1,6)],
                    'data2' : [i for i in range(10,60,10)]})
df5

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

### ë‹¨ì¼ ì»¬ëŸ¼ì˜ ê·¸ë£¹í™”

In [37]:
groups = df5.groupby(df5.key1)
groups

**groups ì†ì„± : GroupByí´ë˜ìŠ¤ê°ì²´ groupsì˜ ê·¸ë£¹ì •ë³´ í™•ì¸**
- ê° ê·¸ë£¹ì˜ ì´ë¦„ì„ í‚¤ë¡œ ê°–ëŠ” íŒŒì´ì¬ ë”•ì…”ë„ˆë¦¬ë¥¼ ë°˜í™˜
- ë”•ì…”ë„ˆë¦¬ ê°’ì€ ê° ê·¸ë£¹ì— ì†í•˜ëŠ” ì¸ë±ìŠ¤ ë ˆì´ë¸”ì˜ ë°°ì—´
- Dict {group name -> group labels}

In [38]:
groups.groups   # ì†í•œ ì¸ë±ìŠ¤ ë²ˆí˜¸ ë„ì¶œ

{'A': [0, 1, 4], 'B': [2, 3]}

**ngroups ì†ì„± : group ìˆ˜ ë°˜í™˜**

In [40]:
groups.ngroups

2

**ê·¸ë£¹í™”ëœ ê²°ê³¼ ì ‘ê·¼**
- ê·¸ë£¹ ë‚´ìš© ì¶œë ¥í•¨ìˆ˜ ì •ì˜ : print_groups(group_object)

In [41]:
def print_groups(group_object):
    for name, group in group_object:
        print(name)
        print(group[:5])

In [42]:
print_groups(groups)

A
  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
4    A  one      5     50
B
  key1 key2  data1  data2
2    B  one      3     30
3    B  two      4     40

-> ê° ê·¸ë£¹ì€ ê·¸ë£¹ëª…ê³¼ ì¼ì¹˜í•˜ëŠ” ê°’ë“¤ì˜ ë¡œìš°ë“¤ë¡œ êµ¬ì„±ëœ ë°ì´í„°í”„ë ˆì„ì„ í•˜ë‚˜ì”© í¬í•¨í•˜ê³  ìˆìŒ

**ê·¸ë£¹ì •ë³´ groupsë¥¼ ë°ì´í„°í”„ë ˆì„ìœ¼ë¡œ ì €ì¥**

In [43]:
pd.DataFrame(groups)

   0                                                  1
0  A    key1 key2  data1  data2
0    A  one      1  ...
1  B    key1 key2  data1  data2
2    B  one      3  ...

- ì²«ë²ˆì§¸ ê·¸ë£¹ ì •ë³´

In [44]:
pd.DataFrame(groups).loc[0]

0                                                    A
1      key1 key2  data1  data2
0    A  one      1  ...
Name: 0, dtype: object

In [45]:
pd.DataFrame(groups).loc[0].values

array(['A',   key1 key2  data1  data2
            0    A  one      1     10
            1    A  two      2     20
            4    A  one      5     50], dtype=object)

- ë‘ë²ˆì§¸ ê·¸ë£¹ ì •ë³´

In [46]:
pd.DataFrame(groups).loc[1].values

array(['B',   key1 key2  data1  data2
            2    B  one      3     30
            3    B  two      4     40], dtype=object)

array(['B',   key1 key2  data1  data2
            2    B  one      3     30
            3    B  two      4     40], dtype=object)

**.size() ë©”ì†Œë“œ : ê° ê·¸ë£¹ì˜ í¬ê¸° ë°˜í™˜**

In [47]:
groups.size()

key1
A    3
B    2
dtype: int64

**.count() ë©”ì†Œë“œ : ê° ê·¸ë£¹ì˜ ì»¬ëŸ¼ë³„ ì•„ì´í…œ ê°œìˆ˜ ë°˜í™˜**

In [49]:
groups.count()

      key2  data1  data2
key1
A        3      3      3
B        2      2      2

**.sum() ë©”ì†Œë“œ : ê° ê·¸ë£¹ì˜ ì»¬ëŸ¼ë³„ í•©ê³„ ë°˜í™˜**

In [50]:
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

**ì„ íƒí•œ ì»¬ëŸ¼ì— ëŒ€í•œ ê·¸ë£¹ë³„ í•©ê³„ ë°˜í™˜1**
- ê·¸ë£¹ê°ì²´[ì»¬ëŸ¼ëª…].sum()
- ê·¸ë£¹ê°ì²´.sum()[ì»¬ëŸ¼ëª…]
- ë°˜í™˜ê°’ì€ ì‹œë¦¬ì¦ˆ í˜•ì‹

In [52]:
groups['data1'].sum()
groups.sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64

key1
A    8
B    7
Name: data1, dtype: int64

In [53]:
type(groups['data1'].sum())

pandas.core.series.Series

**ì„ íƒí•œ ì»¬ëŸ¼ì— ëŒ€í•œ ê·¸ë£¹ë³„ í•©ê³„ ë°˜í™˜2**
- [ì»¬ëŸ¼ëª…]ë¦¬ìŠ¤íŠ¸ë¡œ ì§€ì •í•œ ê²½ìš° : ë°ì´í„°í”„ë ˆì„ í˜•ì‹ìœ¼ë¡œ ë°˜í™˜
- ê·¸ë£¹ê°ì²´[[ì»¬ëŸ¼ëª…]].sum()
- ê·¸ë£¹ê°ì²´.sum()[[ì»¬ëŸ¼ëª…]]

In [57]:
groups[['data1']].sum()
groups.sum()[['data1']]

      data1
key1
A         8
B         7

      data1
key1
A         8
B         7

In [59]:
type(groups[['data1']].sum())

pandas.core.frame.DataFrame

### ë³µìˆ˜ ì»¬ëŸ¼ì˜ ê·¸ë£¹í™”

- .groupby( ) ë©”ì†Œë“œì— ê·¸ë£¹ëª…ì˜ ë¦¬ìŠ¤íŠ¸ë¥¼ ì „ë‹¬í•˜ë©´ ì—¬ëŸ¬ ì»¬ëŸ¼ì— ëŒ€í•´ ê·¸ë£¹í™”ë¥¼ ìˆ˜í–‰

In [62]:
groups2 = df5.groupby([df5.key1, df5.key2])
groups2

**ê·¸ë£¹ì •ë³´ í™•ì¸**
- ë³µìˆ˜ ì»¬ëŸ¼ìœ¼ë¡œ ëœ ê·¸ë£¹ì •ë³´ : íŠœí”Œí˜•íƒœë¡œ ë°˜í™˜

In [63]:
groups2.groups

{('A', 'one'): [0, 4], ('A', 'two'): [1], ('B', 'one'): [2], ('B', 'two'): [3]}

**ê·¸ë£¹ìˆ˜ ë°˜í™˜**

In [64]:
groups2.ngroups

4

**ê·¸ë£¹ì •ë³´ ì¶œë ¥ : print_groups()í•¨ìˆ˜ ì •ì˜**

In [65]:
print_groups(groups2)

('A', 'one')
  key1 key2  data1  data2
0    A  one      1     10
4    A  one      5     50
('A', 'two')
  key1 key2  data1  data2
1    A  two      2     20
('B', 'one')
  key1 key2  data1  data2
2    B  one      3     30
('B', 'two')
  key1 key2  data1  data2
3    B  two      4     40

### ì¸ë±ìŠ¤ ë ˆë²¨ì„ ì´ìš©í•œ ê·¸ë£¹í™”

- ì»¬ëŸ¼ ëŒ€ì‹  ì¸ë±ìŠ¤ì˜ ê°’ì„ ì‚¬ìš©í•´ ê·¸ë£¹í™”

**ì˜ˆì œ ë°ì´í„°**
- ì•ì˜ df2ë¥¼ ê³„ì¸µí˜• ì¸ë±ìŠ¤ë¥¼ ê°–ë„ë¡ ë°ì´í„° êµ¬ì„± ë³€ê²½

In [66]:
df5

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [67]:
data2 = df5.copy()
data2 = data2.set_index(['key1','key2'])
data2

           data1  data2
key1 key2
A    one       1     10
     two       2     20
B    one       3     30
     two       4     40
A    one       5     50

**ë ˆë²¨0(key1)ì„ ì‚¬ìš©í•´ ê·¸ë£¹í™”**

In [68]:
print_groups(data2.groupby(level=0))

A
           data1  data2
key1 key2
A    one       1     10
     two       2     20
     one       5     50
B
           data1  data2
key1 key2
B    one       3     30
     two       4     40

**ë ˆë²¨1(key2)ì„ ì‚¬ìš©í•´ ê·¸ë£¹í™”**

In [69]:
print_groups(data2.groupby(level=1))

one
           data1  data2
key1 key2
A    one       1     10
B    one       3     30
A    one       5     50
two
           data1  data2
key1 key2
A    two       2     20
B    two       4     40

## ê·¸ë£¹ë³„ ì§‘ê³„

### ì°¸ê³ . GroupByê°ì²´ì— ì ìš©ë˜ëŠ” ì§‘ê³„ ê´€ë ¨ ë‚´ì¥ë©”ì†Œë“œ

- gb.agg()
- gb.boxplot()
- gb.cummin()
- gb.describe()
- gb.filter()
- gb.get_group()
- gb.height()
- gb.last()
- gb.median()
- gb.ngroups()
- gb.plot()
- gb.rank()
- gb.std()
- gb.transform()
- gb.aggregate()
- gb.count()
- gb.cumprod()
- gb.dtype()
- gb.first()
- gb.groups()
- gb.hist()
- gb.max()
- gb.min()
- gb.nth()
- gb.prod()
- gb.resample()
- gb.sum()
- gb.var()
- gb.apply()
- gb.cummax()
- gb.cumsum()
- gb.fillna()
- gb.gender()
- gb.head()
- gb.indices()
- gb.mean()
- gb.name()
- gb.ohlc()
- gb.quantile()
- gb.size()
- gb.tail()
- gb.weight()

**ì˜ˆì œ ë°ì´í„° : iris**

In [70]:
import seaborn as sns
iris = sns.load_dataset("iris")

In [71]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

**í””ì¢…ë³„ë¡œ ê·¸ë£¹í™”**

In [72]:
# iris í’ˆì¢…ë³„ë¡œ ê·¸ë£¹
i_group = iris.groupby(iris.species)
i_group

**í’ˆì¢…ë³„ í•©ê³„ ê³„ì‚°**

In [73]:
i_group.sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        171.4          73.1         12.3
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

**í’ˆì¢…ë³„ í‰ê·  ê³„ì‚°**

In [74]:
i_group.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

**í’ˆì¢…ë³„ ê¸°ìˆ í†µê³„**

In [75]:
i_group.describe()

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

### [ ] ì—°ì‚°ìë¥¼ ì‚¬ìš©í•´ íŠ¹ì • ì»¬ëŸ¼ì— ëŒ€í•œ ì§‘ê³„ ì—°ì‚° ìˆ˜í–‰

In [78]:
i_group['sepal_length'].mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

In [79]:
i_group['sepal_length','petal_length'].mean()

C:\Users\user\AppData\Local\Temp/ipykernel_6444/3956188795.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  i_group['sepal_length','petal_length'].mean()

            sepal_length  petal_length
species
setosa             5.006         1.462
versicolor         5.936         4.260
virginica          6.588         5.552

In [80]:
i_group['sepal_length'].describe()

            count   mean       std  min    25%  50%  75%  max
species
setosa       50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor   50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica    50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

## ê·¸ë£¹ë³„ ì§‘ê³„ í•¨ìˆ˜ : apply() / agg() , aggregate()

### agg() ë˜ëŠ” aggregate()

- ê° ê·¸ë£¹ì— ëŒ€í•´ ì§‘ê³„í•¨ìˆ˜ë¥¼ ëª¨ë‘ ì ìš©
- ì ìš©í•  í•¨ìˆ˜ì˜ ì°¸ì¡°ë¥¼ íŒŒë¼ë¯¸í„°ë¡œ ì „ë‹¬
- ë°ì´í„°í”„ë ˆì„ì˜ ê²½ìš° ê·¸ë£¹ ì•ˆì˜ ê° ì»¬ëŸ¼ ë°ì´í„°ì— ì ìš©ë¨
- ìˆ«ì íƒ€ì…ì˜ ìŠ¤ì¹¼ë¼ë§Œ ë¦¬í„´í•˜ëŠ” í•¨ìˆ˜ë¥¼ ì ìš©í•˜ëŠ” apply()ì˜ íŠ¹ìˆ˜í•œ ê²½ìš°
    - ì°¸ê³ . ìŠ¤ì¹¼ë¼(scalar)
        - í•˜ë‚˜ì˜ ìˆ˜ì¹˜(æ•¸å€¤)ë§Œìœ¼ë¡œ ì™„ì „íˆ í‘œì‹œë˜ëŠ” ì–‘
        - ë°©í–¥ì˜ êµ¬ë³„ì´ ì—†ëŠ” ë¬¼ë¦¬ì  ìˆ˜ëŸ‰
        - ì§ˆëŸ‰Â·ì—ë„ˆì§€Â·ë°€ë„(å¯†åº¦)Â·ì „ê¸°ëŸ‰(é›»æ°£é‡) ë”°ìœ„

**GroupBy.agg(func, *args, **kwargs)**

- func : í•¨ìˆ˜ì´ë¦„
    - ë‚´ì¥í•¨ìˆ˜ëŠ” np.sum ë˜ëŠ” 'sum'ìœ¼ë¡œ ì§€ì •, ì‚¬ìš©ìì •ì˜í•¨ìˆ˜ëŠ” í•¨ìˆ˜ì´ë¦„ ê·¸ëŒ€ë¡œ
- *args : í•¨ìˆ˜ì˜ ë§¤ê°œë³€ìˆ˜ë“¤
- **kwargs : í•¨ìˆ˜ì— ë“¤ì–´ê°€ëŠ” í‚¤ì›Œë“œ ì¸ìˆ˜ë“¤

**ê° ì»¬ëŸ¼ì˜ ìµœëŒ€ê°’ê³¼ ìµœì†Œê°’ì˜ ë¹„ìœ¨ ê³„ì‚°**
- í•¨ìˆ˜ peak_to_peak_ratio() ì‘ì„±

In [83]:
def peak_to_peak_ratio(x):
    return x.max() / x.min() # í•¨ìˆ˜ ë°˜í™˜ ê°’ì´ ìˆ˜ì¹˜ ìŠ¤ì¹¼ë¼ íƒ€ì…

- í’ˆì¢…(ê·¸ë£¹)ë³„ ìµœëŒ€ê°’ê³¼ ìµœì†Œê°‘ì˜ ë¹„ìœ¨ ê³„ì‚°

In [84]:
# í’ˆì¢…ë³„ë¡œ ì‚¬ìš©ì ì •ì˜í•¨ìˆ˜ peak_to_peak_ratio ì—°ì‚° ì ìš©
i_group.agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

### agg() ë©”ì†Œë“œì— ì—¬ëŸ¬ í•¨ìˆ˜ ì ìš©

**.agg([í•¨ìˆ˜1, í•¨ìˆ˜2,...])**

In [85]:
i_group.agg([np.sum, np.mean])

           sepal_length        sepal_width        petal_length         \
                    sum   mean         sum   mean          sum   mean
species
setosa            250.3  5.006       171.4  3.428         73.1  1.462
versicolor        296.8  5.936       138.5  2.770        213.0  4.260
virginica         329.4  6.588       148.7  2.974        277.6  5.552

           petal_width
                   sum   mean
species
setosa            12.3  0.246
versicolor        66.3  1.326
virginica        101.3  2.026

In [93]:
i_group.agg(['sum', 'mean'])

           sepal_length        sepal_width        petal_length         \
                    sum   mean         sum   mean          sum   mean
species
setosa            250.3  5.006       171.4  3.428         73.1  1.462
versicolor        296.8  5.936       138.5  2.770        213.0  4.260
virginica         329.4  6.588       148.7  2.974        277.6  5.552

           petal_width
                   sum   mean
species
setosa            12.3  0.246
versicolor        66.3  1.326
virginica        101.3  2.026

### apply( )

: ì–´ë–¤ í•¨ìˆ˜ë‚˜ ì ìš© ê°€ëŠ¥

**GroupBy.apply(func, *args, **kwargs)**

- func : í•¨ìˆ˜ì´ë¦„
    - ë‚´ì¥í•¨ìˆ˜ëŠ” np.sum ë˜ëŠ” 'sum'ìœ¼ë¡œ ì§€ì •, ì‚¬ìš©ìì •ì˜í•¨ìˆ˜ëŠ” í•¨ìˆ˜ì´ë¦„ ê·¸ëŒ€ë¡œ
- *args : í•¨ìˆ˜ì˜ ë§¤ê°œë³€ìˆ˜ë“¤
- **kwargs : í•¨ìˆ˜ì— ë“¤ì–´ê°€ëŠ” í‚¤ì›Œë“œ ì¸ìˆ˜ë“¤

**Top3 ì‚°ì¶œ**
- petal_length ê¸°ì¤€ìœ¼ë¡œ Top3 í•­ëª© ì„ íƒ

In [91]:
def top3_petal_length(df):
    return df.sort_values(by="petal_length", ascending=False)[:3] 

# í•¨ìˆ˜ ë°˜í™˜ê°’ì´ ìˆ˜ì¹˜ ì§‘í•©

- í’ˆì¢…ë³„ë¡œ petal_length ê¸°ì¤€ì˜ Top3

In [94]:
i_group.apply(top3_petal_length)

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     24            4.8          3.4           1.9          0.2
           44            5.1          3.8           1.9          0.4
           23            5.1          3.3           1.7          0.5
versicolor 83            6.0          2.7           5.1          1.6
           77            6.7          3.0           5.0          1.7
           72            6.3          2.5           4.9          1.5
virginica  118           7.7          2.6           6.9          2.3
           117           7.7          3.8           6.7          2.2
           122           7.7          2.8           6.7          2.0

                   species
species
setosa     24       setosa
           44       setosa
           23       setosa
versicolor 83   versicolor
           77   versicolor
           72   versicolor
virginica  118   virginica
           117   virginica
           122   virginica

- agg( )ëŠ” ë°˜í™˜ê°’ì´ ìˆ˜ì¹˜ìŠ¤ì¹¼ë¼ì¸ ê²½ìš°ë§Œ ì‚¬ìš© ê°€ëŠ¥
- apply()ëŠ” ë°˜í™˜ê°’ì´ ìˆ˜ì¹˜ ì§‘í•©ì¸ ê²½ìš° ì ìš© ê°€ëŠ¥

In [48]:
# iris.groupby(iris.species).agg(top3_petal_length) 
# ë°˜í™˜ê°’ì´ ìˆ˜ì¹˜ ìŠ¤ì¹¼ë¼ì¸ ê²½ìš° ì ìš© ê°€ëŠ¥í•œë° ë°˜í™˜ê°’ì´ ìˆ˜ì¹˜ ì§‘í•© ì´ë¯€ë¡œ ì—ëŸ¬ ë°œìƒ

- í’ˆì¢…ë³„ë¡œ ìµœëŒ€ê°’ê³¼ ìµœì†Œê°’ ë¹„ì¤‘

In [46]:
iris.groupby(iris.species).apply(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

**ìˆ˜ì¹˜í˜•ìë£Œë¥¼ ëŒ€,ì¤‘,ì†Œ 3ë²”ì£¼ë¥¼ ê°–ëŠ” ë²”ì£¼í˜•ìœ¼ë¡œ ë³€í™˜ : qcut()**

In [95]:
def q3cut(s):
    return pd.qcut(s, 3, labels=["ì†Œ", "ì¤‘", "ëŒ€"]).astype(str)

**í’ˆì¢…ë³„ë¡œ petal_lengthë¥¼ ëŒ€,ì¤‘,ì†Œ 3ë²”ì£¼ë¡œ ë³€í™˜**

In [96]:
iris.groupby(iris.species).petal_length.apply(q3cut)

0      ì†Œ
1      ì†Œ
2      ì†Œ
3      ì¤‘
4      ì†Œ
      ..
145    ì†Œ
146    ì†Œ
147    ì†Œ
148    ì¤‘
149    ì†Œ
Name: petal_length, Length: 150, dtype: object

**í’ˆì¢…ë³„ë¡œ petal_lengthë¥¼ ëŒ€,ì¤‘,ì†Œ 3ë²”ì£¼ë¡œ ë³€í™˜ëœ ê°’ì„ petal_length_classë³€ìˆ˜ë¡œ ì¶”ê°€**

In [97]:
iris["petal_length_class"] = iris.groupby(iris.species).petal_length.apply(q3cut)
iris.head(10)
iris.tail(10)

,sepal_length,sepal_width,petal_length,petal_width,species,petal_length_class
0,5.1,3.5,1.4,0.2,setosa,ì†Œ
1,4.9,3.0,1.4,0.2,setosa,ì†Œ
2,4.7,3.2,1.3,0.2,setosa,ì†Œ
3,4.6,3.1,1.5,0.2,setosa,ì¤‘
4,5.0,3.6,1.4,0.2,setosa,ì†Œ
5,5.4,3.9,1.7,0.4,setosa,ëŒ€
6,4.6,3.4,1.4,0.3,setosa,ì†Œ
7,5.0,3.4,1.5,0.2,setosa,ì¤‘
8,4.4,2.9,1.4,0.2,setosa,ì†Œ
9,4.9,3.1,1.5,0.1,setosa,ì¤‘

,sepal_length,sepal_width,petal_length,petal_width,species,petal_length_class
140,6.7,3.1,5.6,2.4,virginica,ì¤‘
141,6.9,3.1,5.1,2.3,virginica,ì†Œ
142,5.8,2.7,5.1,1.9,virginica,ì†Œ
143,6.8,3.2,5.9,2.3,virginica,ëŒ€
144,6.7,3.3,5.7,2.5,virginica,ì¤‘
145,6.7,3.0,5.2,2.3,virginica,ì†Œ
146,6.3,2.5,5.0,1.9,virginica,ì†Œ
147,6.5,3.0,5.2,2.0,virginica,ì†Œ
148,6.2,3.4,5.4,2.3,virginica,ì¤‘
149,5.9,3.0,5.1,1.8,virginica,ì†Œ

----------------------------------------

## ê·¸ë£¹í•¨ìˆ˜  ë° í”¼ë´‡ í…Œì´ë¸” ì´ìš© ê°„ë‹¨í•œ ë¶„ì„ ì˜ˆì œ

#### ì‹ë‹¹ì—ì„œ ì‹ì‚¬ í›„ ë‚´ëŠ” íŒ(tip)ê³¼ ê´€ë ¨ëœ ë°ì´í„° : tips

- seaborn íŒ¨í‚¤ì§€ ë‚´ tips ë°ì´í„°ì…‹ ì‚¬ìš©

    - total_bill: ì‹ì‚¬ëŒ€ê¸ˆ

    - tip: íŒ

    - sex: ì„±ë³„

    - smoker: í¡ì—°/ê¸ˆì—° ì—¬ë¶€

    - day: ìš”ì¼

    - time: ì‹œê°„

    - size: ì¸ì›

In [98]:
tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

#### âœ”ì‹ì‚¬ ëŒ€ê¸ˆ ëŒ€ë¹„ íŒì˜ ë¹„ìœ¨ì´ ì–¸ì œ ê°€ì¥ ë†’ì•„ì§€ëŠ”ê°€?

- ê°€ê³µ í•„ë“œ ìƒì„± : ì‹ì‚¬ëŒ€ê¸ˆ ëŒ€ë¹„ íŒì˜ ë¹„ìœ¨
    - tip_pt = íŒ / ì‹ì‚¬ëŒ€ê¸ˆ

   total_bill   tip     sex smoker  day    time  size    tip_pt
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

     total_bill   tip     sex smoker   day    time  size    tip_pt
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   tip_pt      244 non-null    float64
dtypes: category(4), float64(3), int64(1)
memory usage: 9.2 KB

       total_bill         tip        size      tip_pt
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345

In [72]:
# ì„±ë³„ ì¸ì›ìˆ˜ë¥¼ ê³„ì‚°

        total_bill  tip  smoker  day  time  size  tip_pt
sex
Male           157  157     157  157   157   157     157
Female          87   87      87   87    87    87      87

sex
Male      157
Female     87
dtype: int64

In [73]:
# í¡ì—° ìœ ë¬´ì— ë”°ë¥¸ ì„±ë³„ ì¸ì›

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [75]:
# í¡ì—° ìœ ë¬´ì— ë”°ë¥¸ ì„±ë³„ ì¸ì›ì„ í”¼ë´‡í…Œì´ë¸”ë¡œ êµ¬í˜„

smoker  Yes  No
sex
Male     60  97
Female   33  54

In [78]:
# ì„±ë³„ íŒ ë¹„ìœ¨ì˜ í‰ê·

sex
Male      0.157651
Female    0.166491
Name: tip_pt, dtype: float64

In [79]:
# í¡ì—° ìœ ë¬´ì— ë”°ë¥¸ íŒ ë¹„ìœ¨ì˜ í‰ê·

smoker
Yes    0.163196
No     0.159328
Name: tip_pt, dtype: float64

In [77]:
# ì„±ë³„ê³¼ í¡ì—° ìœ ë¬´ì— ë”°ë¥¸ íŒ ë¹„ìœ¨ì˜ í‰ê·

smoker       Yes        No
sex
Male    0.152771  0.160669
Female  0.182150  0.156921

##### ì—¬ì„± í˜¹ì€ í¡ì—°ìì˜ íŒ ë¹„ìœ¨ì´ ì¡°ê¸ˆ ë†’ê³ , ì—¬ì„± í¡ì—°ìê°€ íŒì„ ë§ì´ ì¤Œ

In [82]:
# í‰ê·  í†µê³„ëŸ‰ë§Œ í™•ì¸ í–ˆìœ¼ë¯€ë¡œ ë‹¤ë¥¸ í†µê³„ê°’ë„ í™•ì¸

              tip_pt                                                    \
               count      mean       std       min       25%       50%
sex    smoker
Male   Yes      60.0  0.152771  0.090588  0.035638  0.101845  0.141015
       No       97.0  0.160669  0.041849  0.071804  0.131810  0.157604
Female Yes      33.0  0.182150  0.071595  0.056433  0.152439  0.173913
       No       54.0  0.156921  0.036421  0.056797  0.139708  0.149691


                    75%       max
sex    smoker
Male   Yes     0.191697  0.710345
       No      0.186220  0.291990
Female Yes     0.198216  0.416667
       No      0.181630  0.252672

------------------------------------------------

## ë°ì´í„° ê·¸ë£¹ì˜ ë³€í˜• : transform()

### ë°ì´í„° ë³€í˜•ì˜ ì¼ë°˜ì ì¸ ê³¼ì •

: transform() ë©”ì†Œë“œëŠ” ë°ì´í„°í”„ë ˆì„ì˜ ëª¨ë“  ê°’ì— í•¨ìˆ˜ë¥¼ ì ìš©í•˜ë©°, ë‹¤ìŒì˜ íŠ¹ì„±ì„ ê°–ëŠ” ìƒˆ ë°ì´í„°í”„ë ˆì„ì„ ë°˜í™˜í•œë‹¤

- ëª¨ë“  ê·¸ë£¹ì˜ ì¸ë±ìŠ¤ê°€ í•©ì³ì§„ ì¸ë±ìŠ¤ë¥¼ ê°–ëŠ”ë‹¤
- rowì˜ ê°œìˆ˜ëŠ” ëª¨ë“  ê·¸ë£¹ì˜ row ê°œìˆ˜ì˜ ì´í•©ê³¼ ê°™ë‹¤
- ê·¸ë£¹í™” ëŒ€ìƒì´ ì•„ë‹Œ ì»¬ëŸ¼ë„ í•¨ìˆ˜ê°€ ì„±ê³µì ìœ¼ë¡œ ì ìš©ëœë‹¤ë©´ ê²°ê³¼ì— í¬í•¨ë˜ë©°, ê·¸ë ‡ì§€ ì•Šì€ ì»¬ëŸ¼ì€ ì‚­ì œë  ìˆ˜ ìˆë‹¤

**ì˜ˆì œ ë°ì´í„°1**

In [99]:
trans_data = pd.DataFrame({'Label' : ['A','C','B','A','C'],
                           'Values': [0, 1, 2, 3, 4],
                           'Values2' : [5, 6, 7, 8, 9],
                           'Other': ['foo','bar','baz','fiz','buz']},
                         index=list('VWXYZ'))
trans_data

  Label  Values  Values2 Other
V     A       0        5   foo
W     C       1        6   bar
X     B       2        7   baz
Y     A       3        8   fiz
Z     C       4        9   buz

**Label ì»¬ëŸ¼ìœ¼ë¡œ ê·¸ë£¹í™”**

In [100]:
groups = trans_data.groupby('Label')
groups

In [104]:
print_groups(groups)

A
  Label  Values  Values2 Other
V     A       0        5   foo
Y     A       3        8   fiz
B
  Label  Values  Values2 Other
X     B       2        7   baz
C
  Label  Values  Values2 Other
W     C       1        6   bar
Z     C       4        9   buz

In [105]:
groups.groups

{'A': ['V', 'Y'], 'B': ['X'], 'C': ['W', 'Z']}

### ê° ê°’ì— 10ì„ ë”í•˜ëŠ” í•¨ìˆ˜ë¥¼ ì ìš©í•´ ë°ì´í„°í”„ë ˜ì„ ë³€í˜• ìˆ˜í–‰

In [106]:
groups.transform(lambda x:x+10)

C:\Users\user\AppData\Local\Temp/ipykernel_6444/2373272571.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.transform is deprecated. In a future version, a TypeError will be raised. Before calling .transform, select only columns which should be valid for the transforming function.
  groups.transform(lambda x:x+10)

   Values  Values2
V      10       15
W      11       16
X      12       17
Y      13       18
Z      14       19

-> 'Label'ê³¼ 'Other' ì»¬ëŸ¼ì€ ë¬¸ìì—´ ê°’ë“¤ì´ë¯€ë¡œ í•¨ìˆ˜ ì ìš©ì— ì‹¤íŒ¨í•˜ì—¬ ë‘ ì»¬ëŸ¼ì€ ê²°ê³¼ì—ì„œ ì œì™¸ë¨

### ê·¸ë£¹ì˜ í‰ê· ìœ¼ë¡œ ê²°ì¸¡ê°’ ì±„ìš°ê¸°

**ì˜ˆì œ ë°ì´í„°2**

In [107]:
trans_data2 = pd.DataFrame({'Label' : list('ABABAB'),
                            'Values' : [10, 20, 11, np.nan, 12, 22]})
trans_data2

  Label  Values
0     A    10.0
1     B    20.0
2     A    11.0
3     B     NaN
4     A    12.0
5     B    22.0

In [111]:
groups = trans_data2.groupby('Label')
groups
print_groups(groups)

A
  Label  Values
0     A    10.0
2     A    11.0
4     A    12.0
B
  Label  Values
1     B    20.0
3     B     NaN
5     B    22.0

**ê° ê·¸ë£¹ì˜ í‰ê·  ê³„ì‚°**

In [110]:
groups.mean()

       Values
Label
A        11.0
B        21.0

**ê²°ì¸¡ì¹˜(Nan) ì±„ìš°ê¸°**

- ê·¸ë£¹ë³„ í‰ê· ìœ¼ë¡œ ì±„ìš°ê¸°

In [114]:
fillna = groups.transform(lambda x : x.fillna(x.mean()))
fillna

   Values
0    10.0
1    20.0
2    11.0
3    21.0
4    12.0
5    22.0

## ê·¸ë£¹ í•„í„°ë§ : filter()

- ë°ì´í„°ê·¸ë£¹ì„ ì„ íƒì ìœ¼ë¡œ ì‚­ì œ

**ì˜ˆì œ ë°ì´í„°3**

In [115]:
df3 = pd.DataFrame({'Label' : list('AABCCC'),
                    'Values' : [1, 2, 3, 4, np.nan, 8]})
df3

  Label  Values
0     A     1.0
1     A     2.0
2     B     3.0
3     C     4.0
4     C     NaN
5     C     8.0

**ì•„ì´í…œì˜ ê°œìˆ˜ê°€ ì§€ì •í•œ ìµœì†Œí•œì˜ ìˆ˜ë¥¼ ë„˜ì§€ ì•ŠëŠ” ê·¸ë£¹ì„ ì œì™¸**

In [116]:
df3.groupby('Label').filter(lambda x:x.Values.count()>1)

  Label  Values
0     A     1.0
1     A     2.0
3     C     4.0
4     C     NaN
5     C     8.0

**NaNì´ í•˜ë‚˜ë¼ë„ ì¡´ì¬í•˜ëŠ” ê·¸ë£¹ ì œì™¸**

In [118]:
df3.groupby('Label').filter(lambda x:x.Values.isnull().sum()==0)

  Label  Values
0     A     1.0
1     A     2.0
2     B     3.0

**ì „ì²´ ë°ì´í„°ì…‹ í‰ê· ê³¼ì˜ ì°¨ì´ê°€ 2.0ì´ ë„˜ëŠ” ê·¸ë£¹ í‰ê· ì„ ê°€ì§„ ê·¸ë£¹ë§Œ í•„í„°ë§**

In [119]:
df3.groupby('Label').mean()

       Values
Label
A         1.5
B         3.0
C         6.0

In [121]:
gmean = df3.groupby('Label').mean().mean()

In [122]:
df3.groupby('Label').filter(lambda x:(x.Values.mean() - gmean)>2.0)

  Label  Values
3     C     4.0
4     C     NaN
5     C     8.0